src/pages/talks-index.org
#+TITLE: Talks and Presentations
#+SETUPFILE: setupfile.org
#+HTML_HEAD: <style>#preamble > h1.title { display: none; }</style>
#+DESCRIPTION: Talks and presentations by Lucas Vieira

#+HTML: <h1 class="title"><i class="fa-solid fa-chalkboard-user"></i> Talks and Presentations</h1>

Below are talks and presentations I've given at events,
meetups and webinars over the years, from most recent to oldest.

#+HTML: <div class="talk-year-separator">2024</div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/psx-programming.html">Retro Game Dev: Developing for the PlayStation in 2024</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#7c3aed;color:#fff">UaiDev Talks 2024</span> <span class="badge" style="background:#555;color:#fff">Oct 2024</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/psx-programming.html" class="talk-link">Presentation about developing games for the PlayStation 1 in pure C, with a live demonstration of Sonic The Hedgehog XA running on real hardware (SCPH-5501). Covers the toolchain, the custom engine, and the challenges of programming for 1994 hardware.</a></p>
#+HTML: </div>

#+HTML: <div class="talk-year-separator">2023</div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/uaidev-talks-kickstart.html">Pragmatic Programming: Versatility and lateral thinking in software development</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#7c3aed;color:#fff">UaiDev Talks Kickstart 2023</span> <span class="badge" style="background:#555;color:#fff">Jul 2023</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/uaidev-talks-kickstart.html" class="talk-link">About how versatility and lateral thinking can transform approaches in software development. Practical examples of stepping out of the technical comfort zone and solving problems with creativity.</a></p>
#+HTML: </div>

#+HTML: <div class="talk-year-separator">2022</div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/techimera.html">Container Orchestration with Kubernetes</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#326ce5;color:#fff">Techimera</span> <span class="badge" style="background:#555;color:#fff">Oct 2022</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/techimera.html" class="talk-link">Introduction to container orchestration with Kubernetes: basic concepts, pods, deployments, services, and how to apply them in practice with minikube.</a></p>
#+HTML: </div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/webinar-tecnico-git.html">Technical Webinar: Git</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#f05032;color:#fff">In-company</span> <span class="badge" style="background:#555;color:#fff">Mar 2022</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/webinar-tecnico-git.html" class="talk-link">Technical workshop on Git best practices for development teams. Rebase vs merge, conflict resolution, workflows, and advanced day-to-day commands.</a></p>
#+HTML: </div>

#+HTML: <div class="talk-year-separator">2021</div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/unsafers5-2021.html">Plan 9 from Bell Labs: Alive and Awake</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#7c3aed;color:#fff">V Unsafe.rs Talks 2021</span> <span class="badge" style="background:#555;color:#fff">May 2021</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/unsafers5-2021.html" class="talk-link">Presentation about the Plan 9 operating system and its continued relevance to modern computing. The uniform resource model, the 9P protocol, and composition philosophy.</a></p>
#+HTML: </div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/unsafers-2021.html">AI and Cognition: A Brief History of Cognitive Science and Enactivism</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#7c3aed;color:#fff">I Unsafe.rs Talks 2021</span> <span class="badge" style="background:#555;color:#fff">Apr 2021</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/unsafers-2021.html" class="talk-link">A history of cognitive science and its relationship with artificial intelligence, from the perspective of enactivism. How cognition is not representation, but action coupled to the environment.</a></p>
#+HTML: </div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/eiica_2021_slides.html">Development of Enactive Computational Models for Autopoietic Systems</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#0d6efd;color:#fff">EIICA 2021</span> <span class="badge" style="background:#0a6640;color:#fff">EN</span> <span class="badge" style="background:#555;color:#fff">Mar 2021</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/eiica_2021_slides.html" class="talk-link">Enactive computational models for autopoietic systems, presented at the 11th International Meeting on Information, Knowledge and Action. Academic work in English.</a></p>
#+HTML: </div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/majestic-rustbh.html">Majestic Lisp: From Zero to Lisp in Rust</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#dea584;color:#000">6º Meetup Rust BH</span> <span class="badge" style="background:#555;color:#fff">Dec 2020</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/majestic-rustbh.html" class="talk-link">Building an interpreter for a Lisp dialect from scratch, in Rust. Covers language design, the parsing and eval pipeline, and how literate programming guides development.</a></p>
#+HTML: </div>

#+HTML: <div class="talk-year-separator">2019</div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/ebicc_slides.html">Gödel, Strange Loops and Their Implications in Enactive Theory and Complex Systems</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#0d6efd;color:#fff">XII EBICC</span> <span class="badge" style="background:#555;color:#fff">Sep 2019</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/ebicc_slides.html" class="talk-link">The Strange Loops of Gödel, Escher, Bach and their implications for complex systems and enactive theory. How self-reference and recursion emerge in cognition and biology.</a></p>
#+HTML: </div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/slide-apres-tc.html">Computation in Different Forms</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#555;color:#fff">Nov 2019</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/slide-apres-tc.html" class="talk-link">Presentation on different paradigms and forms of computation, from formal models to practical implementation in various languages.</a></p>
#+HTML: </div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/apresentacao-geb.html">Gödel, Escher, Bach</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#555;color:#fff">Jun 2019</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/apresentacao-geb.html" class="talk-link">Introduction to Douglas Hofstadter's ideas on self-reference, strange loops, and the connection between logic, art, and music.</a></p>
#+HTML: </div>

#+HTML: <div class="talk-year-separator">2018</div>

#+HTML: <div class="talk-item">
#+HTML: <h3><a href="../talks/software-livre.html">Free Software</a></h3>
#+HTML: <p class="talk-meta"><span class="badge" style="background:#555;color:#fff">Dec 2018</span></p>
#+HTML: <p class="talk-desc"><a href="../talks/software-livre.html" class="talk-link">Introductory presentation on the free software movement: philosophy, licenses, community, and impact on the technology industry.</a></p>
#+HTML: </div>